export const regexRules = {
  chineseCharaters: /^[\u4e00-\u9fa5]{0,}$/,//汉字
  chineseAndEng: /^[A-Za-z0-9]+$ 或 ^[A-Za-z0-9]{4,40}$/,//英文和数字
  email: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,//邮箱
  originName: /[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(\.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+\.?/,//域名
  phone: /^(13[0-9]|14[5|7]|15[0|1|2|3|4|5|6|7|8|9]|18[0|1|2|3|5|6|7|8|9])\d{8}$/,
  strongPass: /^(?:.*\d)(?:.*[a-z])(?:.*[A-Z]).{8,10}$/,//必须包含大小写字母和数字的组合，可以使用特殊字符，长度在8-10之间
  strongPassNoSpe: /^(?:.*\d)(?:.*[a-z])(?:.*[A-Z])[a-zA-Z0-9]{8,10}$/,//必须包含大小写字母和数字的组合，不能使用特殊字符，长度在 8-10 之间
  EMScode: /[1-9]\d{5}(?!\d)/,//中国邮政编码
  IP: /((?:(?:25[0-5]|2[0-4]\\d|[01]?\\d?\\d)\\.){3}(?:25[0-5]|2[0-4]\\d|[01]?\\d?\\d))/,//IP地址
  QQ: /[1-9][0-9]{4,}/
}